#include "InOperator.h"

static int menu(void){
    /* для меню -> ╭, ╮, ╰, ╯, ─, │, ├, ┤*/
    printf("╭─────────────────────────────────────────────╮\n");
    printf("│                 Меню NetWatch               │\n");
    printf("╰─────────────────────────────────────────────╯\n");
    printf("╭─────────────────────────────────────────────╮\n");
    printf("│              Доступные команды              │\n");
    printf("├─────────────────────────────────────────────┤\n");
    printf("│     1.Список устройств и их статусов        │\n");
    printf("│     2.Детали устройства (последние метрики) │\n");
    printf("│     3.История метрик за период              │\n");
    printf("│     4.Журнал тревог                         │\n");
    printf("│     5.Отправка команды устройству           │\n");
    printf("│     6.Live-режим                            │\n");
    printf("╰─────────────────────────────────────────────╯");
    printf("\n\nВыберите пункт: ");
}

int Operator_m(void){
    int input;
    
    menu();
    scanf("%d", &input);
    
    switch (input)
    {
    case 1:
        /*сюда потом добавится функция*/
        break;
    case 2:
        /*сюда потом добавится функция*/
        break;
    case 3:
        /*сюда потом добавится функция*/
        break;
    case 4:
        /*сюда потом добавится функция*/
        break;
    case 5:
        /*сюда потом добавится функция*/
        break;
    case 6:
        /*сюда потом добавится функция*/
        break;
    
    default:
        printf("Неверный выбор команды");
        break;
    }
}